{
  "route": "framework/user/en/web-form/settings",
  "sourceUrl": "https://docs.frappe.io/framework/user/en/web-form/settings",
  "title": "Webform Settings",
  "content": "Webform Settings\n\nThere are multiple checkboxs in the Settings tab that can be used to enable and disable different functionalities.\n\nLogin Required\n\nIf you want responses from guest user, just disable the login_required checkbox. Logged In users can also use it. It is disabled by default.\n\nIf you only want responses from logged in user just enable the login_required checkbox.\n\n Enabling it will make Allow Multiple Responses, Allow Editing After Submit, Allow Delete, Allow Comments, Show Attachments and Show List checkboxes visible.\n\nAllow Multiple Responses\n\nIt is used to enable users to give multiple responses which they can see in Webform List View.\n\n Enabling it will also enable show_list checkbox in List Setting section\n\nAllow Editing After Submit\n\nIt will allow user to edit there submitted responses.\n\nAllow Delete\n\nIt will allow user to delete there submitted responses from Webform List View.\n\nAnonymous\n\nBy setting this the response received will be anonymous.\n\nApply Document Permission\n\nBy default if user has read access to the documents submitted by different users it will be visible in the Webform List View. But he/she can only open the record from list view if Apply Document Permission checkbox is checked.\n\nAllow Print\n\nIt will add a print button to print the document. It will only be visible on View Mode.\n\nAllow Comments\n\nIt will add comment section below the webform where users can communicate. All the comments will be linked to the document.\n\nShow Attachments\n\nIt will show all the attachments attached in the document in Attachment Section.\n\nMax Attachment Size (in MB)\n\nIt will restrict users to attach large files.\n\nAllow Incomplete Forms\n\nIt will allow submission of forms even if mandatory fields are not populated.\n\nList Settings\n\n \n\nShow List\n\nIt will enable List View where you can see all the submitted forms. You can only open the form that you own. \n\n If apply_document_permissions is enabled you can open other forms.\n\nTitle & List Columns\n\nYou can change the title of the list and also can add/remove/arrange list view columns \n\nSidebar Settings\n\n \n\nShow Sidebar\n\nShow webform with sidebar. Select or create a website sidebar where you can add link to current webform and other related webforms or webpages.",
  "scrapedAt": "2025-10-22T00:03:54.294Z"
}