{
  "route": "framework/user/en/form-tours",
  "sourceUrl": "https://docs.frappe.io/framework/user/en/form-tours",
  "title": "form-tours",
  "content": "Frappe provides an easy way to generate form tutorials for your complex doctype with very little configuration.\n\n \n\nCreating a Form Tour\n\nTo create a Form Tour, type \"new form tour\" in awesomebar and hit enter.\n\nEnter Title. For eg., 'Creating a Custom Field'\nSelect Reference DocType.\nAdd steps defining each fields.\nSave the document.\n\n A Tour to explain creation of Custom Fields\n\nConfiguration Options\n\nForm Tour\n\nIs Standard: To make a standard Form Tour which will be stored as JSON. Can only be set while developer mode is on.\nSave on Completion: If checked, the last step of the Form Tour will prompt the user to save the document.\nShow First Document Tour: If you want to show the tour of an existing document instead of a new form, enable this. As the name suggests, it gives the tour of the very first document created for this DocType.\nInclude Name Field: For some doctypes, the name is set by the user. On enabling this, the name field becomes the first step of the tour.\n\nForm Tour Steps\n\nField: A field from the selected doctype. This will be highlighted with a Title & Description.\nTitle & Description: To describe the field for its use, impact, and other hidden wirings of the field.\nPosition: The position of the highlighting popover is decided by this field. There are multiple options to choose depending upon the position of the highlighted field.\nNext Condition: A code field which expects a valid JS condition which applies on the document. For eg., for a Task DocType Tour, we can check if task priority is set before going to the next condition by setting next condition as follows:\n\neval: doc.priority != \"\"\n5. Is Table Field: To be checked if the field to be highlighted is under a child table.\n6. Parent Field: Table field from the selected doctype. Only visible if Is Table Field is checked. Allows user to select a child table field.\n\nTriggering the Tours\n\nOnce you are done describing the Form & its fields, you are now ready to trigger the tour by using Form API. You just have to initialize the tour with appropriate tour_name and then simply start the tour with frm.tour.start().\n\nfrappe.ui.form.on('Your DocType', {\n onload: function(frm) {\n const tour_name = 'Your Form Tour Name';\n frm.tour.init({ tour_name }).then(() => frm.tour.start());\n }\n});",
  "scrapedAt": "2025-10-22T00:02:10.737Z"
}