{
  "route": "framework/user/en/guides/app-development/fetch-custom-field-value-from-master-to-all-related-transactions",
  "sourceUrl": "https://docs.frappe.io/framework/user/en/guides/app-development/fetch-custom-field-value-from-master-to-all-related-transactions",
  "title": "fetch-custom-field-value-from-master-to-all-related-transactions",
  "content": "Let's say, there is a custom field \"GSTIN\" in Supplier, which should be fetched in Purchase Order.\n\nScenario I: You want to keep this field updated\n\nIn this scenario, the custom field will be updated automatically based on the value in Supplier when you save the Purchase Order and will be re-updated everytime you save the Purchase Order. Since this field needs to be updated automatically, it overwrites user input. If you want to allow user input, refer to Scenario II.\n\nSteps:\n\nCreate a Custom Field GSTIN for Supplier document with Field Type as Data.\n\nCreate another Custom Field GSTIN for Purchase Order document, but in this case with Field Type as Read Only or check Read Only checkbox. Set Fetch From as supplier.gstin.\n\nGo to the user menu and click \"Reload\".\nNow, on selection of Supplier in a new Purchase Order, GSTIN will be fetched automatically from the selected Supplier.\n\nScenario II: You want to allow user input if value not found\n\nIn this scenario, the value is fetched from the Supplier the first time the Purchase Order is created. If the value is not found in Supplier, you can enter it manually. The value will only be fetched on saving Purchase Order if the field is empty.\n\nSteps:\n\nCreate a Custom Field GSTIN for Supplier document with Field Type as Data.\n\nCreate another Custom Field GSTIN for Purchase Order document with Field Type as Data. Set Fetch From as supplier.vat_number and tick the checkbox titled Fetch If Empty.\n\nGo to the user menu and click \"Reload\".\nNow, on selection of Supplier in a new Purchase Order, GSTIN will be fetched automatically from the selected Supplier. If GSTIN is not found in supplier, you can enter it manually.",
  "scrapedAt": "2025-10-22T00:02:42.382Z"
}