{
  "route": "framework/user/en/tutorial",
  "sourceUrl": "https://docs.frappe.io/framework/user/en/tutorial",
  "title": "In this guide, you will learn how to create a web application from scratch using",
  "content": "In this guide, you will learn how to create a web application from scratch using\nthe Frappe Framework.\n\nWho is this for?\n\nThis guide is intended for software developers who are familiar with how web\napplications are built. The Frappe Framework is powered by Python, JavaScript\nand Redis, to name a few technologies and supports MariaDB and PostgreSQL\ndatabases. Jinja is used as the templating engine for Web Views and Print\nformats. Redis is used for caching, maintaing job queues and realtime updates.\nHowever, you may not need to be proficient in all these tools to get started\nwith it.\n\nFrappe Framework and the apps you build on it require git for version control\nand update management via Bench. It is also expected that you are familiar with\nbasic git commands.\n\nWhat are we building?\n\nWe will build a simple Library Management System in which the Librarian\ncan log in and manage Articles and Memberships. We will build the following\nmodels:\n\nArticle: A Book or similar item that can be rented.\nLibrary Member: A user who is subscribed to a membership.\nLibrary Transaction: An Issue or Return of an article.\nLibrary Membership: A document that represents an active membership of a\nLibrary Member.\nLibrary Settings: Settings that define values like Loan Period and\nthe maximum number of articles that can be issued at a time.\n\nThe Librarian will log in to an interface known as Desk, a rich admin\ninterface that ships with the framework. The Desk provides many standard views like\nList view, Form view, Report view, etc, and many features like Role-based\nPermissions.\n\nWe will also create public Web Views which can be accessed by the Library\nMembers where they can browse available Articles.\n\nTable of Contents\n\nCreate a Bench\nCreate an App\nCreate a Site\nCreate a DocType\nDocType Features\nController Methods\nTypes of DocType\nForm Scripts\nPortal Pages\nWhat's Next",
  "scrapedAt": "2025-10-22T00:01:01.453Z"
}