{
  "route": "framework/user/en/basics/sites",
  "sourceUrl": "https://docs.frappe.io/framework/user/en/basics/sites",
  "title": "sites",
  "content": "Frappe is a multitenant platform and each tenant is called a site. A site has its own database. Sites exist in a directory called sites, assumed as the current working directory when running a bench command.\n\nSites Directory\n\nThe sites directory frappe-bench/sites is where all the sites for this bench live. It also contains some other files and directories which are explained next.\n\napps.txt\n\nThis file contains a list of Frappe apps. An app should be listed here before it can be installed on a site. It is added automatically when bench get-app command or bench new-app command is run.\n\ncommon_site_config.json\n\nConfiguration common to all sites can be put in this file. Learn more about site configuration.\n\nassets\n\nAssets contain files that are required to be served for the client browser. These generally include *.js, *.css, and image files. This directory is auto generated using the bench build command. This directory is served by Nginx in production.\n\nCreating a new site\n\nTo create a new site, run the following command from the frappe-bench directory:\n\n$ bench new-site mysite.localhost\n\nInstalling frappe...\nUpdating DocTypes for frappe : [========================================]\nUpdating country info : [========================================]\n*** Scheduler is disabled ***\n\nThe mysite.local directory will now be created in the sites directory.\n\nDirectory Structure\n\nsites/mysite.localhost\n├── locks\n├── private\n│&nbsp;&nbsp; ├── backups\n│&nbsp;&nbsp; └── files\n├── public\n│&nbsp;&nbsp; └── files\n├── site_config.json\n└── task-logs\n\nlocks\n\nThis directory is used by the scheduler to synchronize various jobs using the file locking concept.\n\nprivate\n\nThis directory contains files that require authentication to access. It contains private files and backups. They can be accessed by the URL: /private/files/private-file.png.\n\npublic\n\nThis directory contains publicly accessible files. They can be accessed by the URL: /files/public-file.png.\n\nsite_config.json\n\nThis file contains site specific configuration.\n\nSite Config\n\nA file named site_config.json exists in every site directory and is used to store site specific configuration. The values are available in frappe.conf local variable as a dict.\n\nExample site_config.json:\n\n{\n \"db_name\": \"test_frappe\",\n \"db_password\": \"test_frappe\",\n \"admin_password\": \"admin\",\n}\n\nTo learn more about managing Site or Bench level configurations, checkout this comprehensive document.\n\nSite Resolution\n\nWhile responding to an HTTP request, a site is automatically selected based on,\n\nHost header in the HTTP request matches a site\nX-Frappe-Site-Name header in the HTTP request matches a site\n\nIt is also possible to force the development server to serve a specific site by starting it with the following command:\n\nbench --site mysite.localhost serve\n\nSet a site as the current site\n\nTo force a site to be used as the default site, run the following command:\n\nbench use mysite.localhost\n\nAfter running this command, site specific commands can be run without the --site parameter.\n\nFor example, instead of running:\n\nbench --site mysite.localhost migrate\n\nYou can just run:\n\nbench migrate",
  "scrapedAt": "2025-10-22T00:01:17.268Z"
}