{
  "route": "framework/user/en/guides/integration/google_gsuite",
  "sourceUrl": "https://docs.frappe.io/framework/user/en/guides/integration/google_gsuite",
  "title": "google_gsuite",
  "content": "Frappe allows you to use Google's Gsuite documents as templates, generate from them a new Gsuite document that will be placed in a chosen folder. Variables can populated in both the body and the name of the Gsuite document using the standard Jinja2 format. Once generated, the Gsuite document will remain associate to the DocType as an attachment.\n\nThe Gsuite document is generated by invoking the \"attach file\" function of any DocType.\n\nA common use cases of this features is populating contracts from customer/employee/supplier data.\n\n1. Enable integration with Google Gsuite\n\n1.1 Publish Google apps script\n\nIf you will use the default script you can go to 1.2\n\nGo to https://script.google.com\nCreate a new Project. Click on File > New > Project\nCopy the code of Desk > Explore > Integrations > GSuite Settings > Google Apps Script to clipboard and paste to an empty Code.gs in script.google.com\nSave the Project. Click on File > Save > Enter new project name\nDeploy the app. Click on Publish > Deploy as web app\nCopy \"Current web app URL\" into Desk > Explore > Integrations > GSuite Settings > Script URL\nClick on OK but don't close the script\n\n1.2\n\n1.2 Get Google access\n\nGo to your Google project console and select your project or create a new one. https://console.developers.google.com\nIn Library click on Google Drive API and Enable\nClick on Credentials > Create Credentials > OAuth Client ID\nFill the form with:\n\nWeb Application\nAuthorized redirect URI as http://{{ yoursite }}/?cmd=frappe.integrations.doctype.gsuite_settings.gsuite_settings.gsuite_callback\n\nCopy the Client ID and Client Secret into Desk > Explore > Integrations > GSuite Settings > Client ID and Client Secret\nSave GSuite Settings\n\n1.3 Test Script\n\nClick on Allow GSuite Access and you will be redirected to select the user and give access. If you have any error please verify you are using the correct Authorized Redirect URI.\nYou can find the complete URI Gsuite redirected to in the final part of the URL of the error page. Check that the protocol http:// or https:// matches the one your using.\nClick on Run Script test. You should be asked to give permission.\n\n2. GSuite Templates\n\n2.1 Google Document as Template\n\nCreate a new Document or use one you already have. Set variables as you need. Variables are defined with {{VARIABLE}} with VARIABLE is the field of your Doctype\n\nFor Example,\nIf this document will be used to employee and the Doctype has the field name then you can use it in Google Docs ad {{name}}\nGet the ID of that Document from url of your document.\nFor example: in this document url https://docs.google.com/document/d/1Y2_btbwSqPIILLcJstHnSm1u5dgYE0QJspcZBImZQso/edit the document ID is 1Y2_btbwSqPIILLcJstHnSm1u5dgYE0QJspcZBImZQso\nGet the ID of the folder where you want to place the generated documents. (You can step this point if you want to place the generated documents in Google Drive root. )\n\nFor example: in this folder url https://drive.google.com/drive/u/0/folders/0BxmFzZZUHbgyQzVJNzY5eG5jbmc the folder ID is 0BxmFzZZUHbgyQzVJNzY5eG5jbmc\n\n2.2 Associate the Template to a Doctype\n\nGo to Desk > Explore > Integrations > GSuite Templates > New\nFill the form with:\n\nTemplate Name (Example: Employee Contract)\nRelated DocType (Example: Employee)\nTemplate ID is the Document ID you get from your Google Docs (Example: 1Y2_btbwSqPIILLcJstHnSm1u5dgYE0QJspcZBImZQso)\nDocument name is the name of the new files. You can use field from DocType (Example: Employee Contract of {name})\nDestination ID is the folder ID of your files created from this Template. (Example: 0BxmFzZZUHbgyQzVJNzY5eG5jbmc)\n\n3. Create Documents\n\nGo to a Document you already have a Template for (Example: Employee > John Doe)\nClick on Attach File\nOn GSuite Document section select the Template and click Attach\nYou should see the generated document is already created and attached\nClicking on the attached document will open it inside Gsuite",
  "scrapedAt": "2025-10-22T00:03:12.572Z"
}