{
  "route": "framework/user/en/using_frappe_as_oauth_service",
  "sourceUrl": "https://docs.frappe.io/framework/user/en/using_frappe_as_oauth_service",
  "title": "using_frappe_as_oauth_service",
  "content": "In this guide we will learn how to use Frappe Framework for authenticating 3rd party apps with OAuth. We will learn how to set up Grafana server and how to connect to the Frappe Framework for authenticating Grafana.\n\nWe hope this guide will be useful for beginners and we won’t be writing any code other than some configuration files.\n\nPrerequisites\n\nA server running a debian based system(Debian, Ubuntu, Pop OS etc..)\nA Frappe Cloud account. You can sign up for Frappe Cloud here\n\nOR\n* A Frappe Framework site(easier if it’s on the same server)\n* Basic text editing knowledge\n\nFrappe Framework\n\nFrappe Framework is a low-code, Python, and JavaScript web framework that is used to build delightful web applications. Frappe framework was initially developed for building enterprise-level applications, but it has evolved to be a framework for building general-purpose applications without much fuss. It’s open source and MIT licensed.\n\nThe interesting thing about Frappe Framework is that you don’t have to write code to make everything work. It was built to be as useful for anyone without prior programming knowledge. You can generate DB schemas, REST APIs, Webhooks, Reports and much more without writing a single line of code. You can check all the feature here\n\nGrafana\n\nGrafana is an awesome metrics visualization platform built by Grafana Labs. Grafana generates interactive graphs from data and can be used for alerting. Grafana has dashboards, which can pull data from the data source and generate graphs that make the most sense out of the data. Grafana is used internally at Frappe for visualizing server statistics for multiple clients and gives a lot of insights to the servers.\n\nInstalling Frappe Framework\n\nInstalling the Frappe Framework is an art in itself. It requires many moving parts for optimal functioning. Don't let this make you afraid; we have an elaborate guide on how to install and setup Frappe Framework in the Framework documentation.\n\nIf you want the easy way, you can install and setup Frappe Framework with Docker. You can read more about it here.\n\nThe easiest way is to use Frappe Cloud to spin up a new site with Frappe Framework installed.\n\nInstalling Grafana\n\nFor installing Grafana, you can refer to the Official Grafana Installation Guide. We are assuming you're installing Grafana on a Debian-based system.\n\nOnce installed, you have to add grafana to systemd. You can do that by\n\n# add to systemd to start on bootup\nsystemctl enable grafana-server.service\n# start the service\nsystemctl start grafana-server\n# check status\nsystemctl status grafana-server\n\nConfiguring Frappe for OAuth\n\nOnce you have logged into your site and completed the getting started process for the site, we will create a new entry in the OAuth Client doctype.\n\nFor accessing the OAuth Client doctype, you can use the awesomebar or press Ctrl + G to invoke the awesomebar and type in \"OAuth Client\", the autocomplete will show you the list of options.\n\n \n\nSelect \"New OAuth Client\" from the dropdown, and you'll be taken to a page for adding the OAuth scopes and settings for the application you want to add OAuth for.\n\n \n\nHere, you have to configure the:\n\nApp Name (Grafana here)\nOpen ID scopes\nRedirect URIs\n\nThe redirect URI for Grafana from their docs is <grafana-url>/login/generic_oauth. > If you’re on a server without a URL, you can provide the IP address of the server for the <grafana-url> part.\n\nOnce you have added the details in the respective fields, you will receive an App Client ID and App Client Secret. These will be used in the Grafana configuration for the OAuth setup.\n\n \n\nConfiguring Grafana for OAuth\n\nAs we have our Client ID and Client Secret from our Frappe framework site, it's time to connect to our Grafana server for the authentication.\n\nThe Grafana configuration files are in the /etc/grafana folder on an Ubuntu/Debian system. We will be editing the grafana.ini file.\n\n$ sudo vim grafana.ini\n\nInside the configuration file, for setting up OAuth, you need to edit the [oauth.generic_oauth] section. Here you have to uncomment the lines and add the required data.\n\n[auth.generic_oauth]\nenabled = True\nname = Frappe\nclient_id = \"\"\nclient_secret = \"\"\nscopes = openid all\nauth_url = <frappe_site_url>/api/method/frappe.integrations.oauth2.authorize\ntoken_url = <frappe_site_url>/api/method/frappe.integrations.oauth2.get_token\napi_url = <frappe_site_url>/api/method/frappe.integrations.oauth2.openid_profile\n\nAlso, you will have to add the domain name of the Grafana server to the config if you're using a reverse proxy. You can define the domain and root_url in the server section of the grafana.ini file.\n\nOnce you have done this and saved the file, you have to restart Grafana to make it work. You can use\n\n$ sudo systemctl restart grafana-server.service\n\nto restart Grafana on an Ubuntu/Debian system.\n\nThat is mostly it. Now reload your Grafana site, and you'll be able to see a \"Sign in with Frappe\" button on the login page.\n\n \n\nIf you have done everything correctly, you'll be logged into Grafana with the credentials from your Frappe site.",
  "scrapedAt": "2025-10-22T00:03:19.632Z"
}