{
  "route": "framework/user/en/zero*_downtime_migrations",
  "sourceUrl": "https://docs.frappe.io/framework/user/en/zero*_downtime_migrations",
  "title": "zero*_downtime_migrations",
  "content": "Zero* downtime migrations let the site run in read only mode during site upgrade process. This means your static site, dynamic pages which only need to read data can continue to work without any noticable difference. Any actions that requires writing to database will be disabled and only resume when upgrade is finished.\n\nHow does this work\n\nZero downtime migration utilizes one of following two means to enable read-only mode:\n\nUsing read-replicas.\nUsing \"read only transactions\" which are provided by databases.\n\nIn either case writes on your database are disabled until maintenance mode is lifted.\n\nBoth web pages and Desk will show persisten read only warnings during updates. All forms are also made read only so you can not modify any data.\n\nCaveats to keep in mind\n\nNot all apps automatically support this feature. They might behave erratically if they are not designed to work in read only mode.\nDuring update database schema changes, client side app is updated so you'll ocassionally face some glitches. These can not be fully avoided, the intent behind this feature is only to reduce the impact of downtime.\n\nEnabling Read Only Mode during upgrades\n\n[Optional/Recommended] - Setup a read replica by following the replication guide\nEdit your site config to enable this feature. bench --site develop set-config allow_reads_during_maintenance 1\n\nSupporting read only mode in your app\n\nIf you are an app developer and want to add support for this feature in your app then you need to modify your app\n\nServer side changes\n\nYou can use frappe.flags.read_only to disable or modify behaviour in read only mode.\n\nExample: Logging page visits\n\n@frappe.whitelist()\ndef log_visit():\n if frappe.flags.read_only:\n return\n\n doc = frappe.new_doc(\"Doc Visit\")\n doc.insert()\n\nJinja / Client side page changes\n\nYou should ideally update the UI to indicate that your app is in read only mode and write-actions can not be performed right now.\n\nWebsite context includes read_only_mode key in context by default, you can use this to add warning or toggle features on your pages conditionally. Example:\n\n<!-- some html page -->\n{% if read_only_mode %}\n <div class=\"alert\">Site is running in read only mode. Full functionality will be restored soon.</div>\n{% endif %}\n<!-- other content -->",
  "scrapedAt": "2025-10-22T00:04:40.325Z"
}