{
  "route": "framework/user/en/guides/integration/google_calendar",
  "sourceUrl": "https://docs.frappe.io/framework/user/en/guides/integration/google_calendar",
  "title": "google_calendar",
  "content": "Frappe provides an integration with Google Calendar in order for all users to synchronize their events.\n\nSetup\n\nIn order to allow a synchronization with Google Calendar you need to connect to your application in Google Cloud Platform and then create an account for each of your users:\n\nCreate a new project on Google Cloud Platform and generate new OAuth 2.0 credentials\nAdd https://{yoursite} to Authorized JavaScript origins\nAdd https://{yoursite}?cmd=frappe.integrations.doctype.gcalendar_settings.gcalendar_settings.google_callback as an authorized redirect URI\nAdd your Client ID and Client Secret in the Gcalendar application: in \"Modules>Integrations>Google Calendar>GCalendar Settings\"\n\nOnce this step is successfully completed, each user can create their own account in Google Calendar > GCalendar Account.\nThey will be requested to authorize your Google application to access their calendar information and will then be redirected to a success page.\n\nFeatures\n\nCreation of a new calendar in Google Calendar\n\nEach User can choose a dedicated name for their Google Calendar.\n\nEvents synchronization from Frappe to GCalendar\n\nAll Events created in Frappe are created in Google Calendar.\nRecurring Events are created as recurring events too.\nYou can optionally add a Google Meet conference link to the Event.\nAll participants (User email) will be added to the Event.\nEvents modified in Frappe are updated in Google Calendar.\nEvents deleted in Frappe are deleted in Google Calendar.\n\nEvents synchronization from GCalendar to Frappe\n\nEvents created in Google Calendar are created in Frappe.\nEvents updated in Google Calendar are updated in Frappe.\n\nThe synchronization module follows Frappe's authorization rule: An event will be only synchronized if it is public or if the user is the owner.\n\nLimitations\n\nCurrently, if an instance of a recurring event is cancelled in Google Calendar, this change will not be reflected in Frappe.",
  "scrapedAt": "2025-10-22T00:03:16.295Z"
}