{
  "route": "framework/user/en/blog-post",
  "sourceUrl": "https://docs.frappe.io/framework/user/en/blog-post",
  "title": "blog-post",
  "content": "A Blog Post is an article on your website.\n\nBlogs are a great way to share your thoughts about your business.\nIt helps keep your customers and readers updated on news related to your business.\n\nIn the age of the internet, writing assumes a lot of significance because when\npeople come to your website, they want to read about you and your product.\n\nTo access the Blog Post, go to:\n\n Home > Website > Blog > Blog Post\n\n1. How to create a Blog Post\n\nGo to the Blog Post list and click on New.\nEnter the Title, Blog Category, Blogger, and the Content.\nEnable Published and click on Save.\n\nThe Blog Intro is a short description of your blog that appears just after the\ntitle and before the content.\n\nYou can write your blog in Rich Text, Markdown, or HTML. If you want to write\nsimple content pages, Rich Text and Markdown are great options.\n\n Learn markdown in a few minutes at Mastering Markdown.\n\nBlog Post in Markdown\n\nView your Blog Post by clicking on See on Website in the sidebar.\n\nBlog Post\n\nReaders can comment on the blog post. The guest user will have to enter their Name and Email to comment.\n\nCheck the Disable Comments option if you'd like to disable the ability for readers to add comments to the current blog post.\n\nAdding Comments Disabled\n\nReaders can give likes on their favorite blog posts.\n\nLike\n\nCheck the Disable Likes option if you'd like to disable the ability for readers to give like to the current blog post.\n\nWhen a reader comments on a blog post or gives a like, an email is sent to the blogger with a link to the comment/like on the blog post.\nIf the blogger doesn't want to receive any email he/can uncheck the Enable Email Notification checkbox.\n\n2. Features\n\n2.1 Blogger\n\nBlogger is a user who can post blogs. To create a Blogger, go to:\n\n Home > Website > Blog > Blogger\n\nYou can mention a short bio about the blogger and also set an avatar here.\n\nBlogger\n\nThe preview will be shown at the end of the blog post.\n\nBlogger Preview\n\n2.2 Blog Category\n\nYou can group your blogs into categories. To create a new Blog Category, go to:\n\nHome > Website > Blog > Blog Category.\n\nBlog Category\n\nIf you click on See on Website in the sidebar, you'll be redirected to a\nlist of blogs under that category.\n\nBlog Category - General\n\n2.3 Meta Tags\n\nMeta tags are HTML tags which describe a page and its content to a search engine or a social media platform. A meta description provides a brief description of a webpage.\n\nIn HTML, the meta description tag will be written as follows:\n\nUnder the SEO section, you can add the meta description and image for your blog post. ERPNext will generate a preview of the blog when listed as a search result by Google.\n\nIf you leave this section empty, the blog introduction or the first 140 characters of the blog will be shown as the meta description. In the same way, if you leave the meta image empty, the first image in the blog will be selected.\n\nBlog Post Google Search Preview\n\nOn submitting the blog, you can also preview how the blog will look when shared on a social media platform like Facebook or Twitter. To check this, use the debugging tools offered by the platforms:\n\nFacebook: Sharing Debugger\nTwitter: Card Validator\nLinkedIn: Post Inspector\n\nTo check the post preview, simply enter the webpage/blog link in the tool:\n\nUsing Facebook's Sharing Debugger Tool\n\nUsing these tools, you can optimize your blog post for sharing.",
  "scrapedAt": "2025-10-22T00:03:50.959Z"
}