{
  "route": "framework/user/en/desk",
  "sourceUrl": "https://docs.frappe.io/framework/user/en/desk",
  "title": "Frappe Framework comes with a rich admin interface called the Desk. It reads meta-data",
  "content": "Frappe Framework comes with a rich admin interface called the Desk. It reads meta-data\nfrom DocTypes and automatically builds list views, form views, report views, etc\nfor your DocTypes. Desk is to be used by users of the type \"System User\".\n\nIn this section we will discuss what views are provided by Desk and how to configure them.\n\nWorkspace\nAwesomebar\nList View\nForm View\nGrid View\nReport Builder\nTree View\nCalendar View\nGantt View\nKanban View\nDesk Theme\n\nWorkspace\n\nWhen you login, you're presented with the Desk, it features a persistent sidebar with some standard items based on app modules.\nEach sidebar item links to a page called Workspace.\n\nAbout Workspace →\n\nAwesomebar\n\nAwesomebar helps you to navigate anywhere in the system, create new records, search in documents\nand even perform math operations.\n\nNavigating ToDo using Awesomebar\n\nList View\n\nList View is generated for all DocTypes except which are Child Tables and Singles.\n\nThe List view is packed with features. Some of them are:\n\nFilters\nSorting\nPaging\nFilter by tags\nSwitch view to Report, Calendar, Gantt, Kanban, etc.\n\n Learn more about the List API.\n\nForm View\n\nForm view is used to view the records in a Form Layout. This view has a lot of\nthings going on. But the primary purpose of it is to view and edit records.\nA document can be assigned to or shared with other users and it can have arbitrary\nattachments and tags, all of which can be seen in the form sidebar.\n\nForm View\n\nWhen you scroll down to the bottom of the form, you will see the form timeline.\nThe form timeline shows emails, comments, edits and other events in a reverse\nchronological order.\n\nForm Timeline\n\n Learn more about the Form API.\n\nGrid View\n\nGrid view is used as a table in the form view to insert multiple records.\nUser can configure the columns of the grid view from the form.\n\nReport Builder\n\nReport Builder is a generic tool to customize and build tabular data from a DocType.\nYou can select columns to show, filters to apply, sort order and save this configuration\nby giving your report a name. You can also show Child Table data and also filter\ndocuments by their child records. You can also apply Group By on a column with\naggregation methods like Count, Sum and Average.\n\nReport Builder Features\n\nTree View\n\nFrappe also supports tree structured records using the Nested set model.\nIf a doctype is configured to be a tree structure, it can be viewed in the Tree view.\n\nTree View\n\nCalendar View\n\nCalendar view can be configured for DocTypes with a start date and end date.\n\nCalendar View\n\nThe configuration file should be named {doctype}_calendar.js and should exist in the\ndoctype directory.\n\nHere is an example configuration file for calendar view for Event doctype, which must be set in the event_calendar.js file.\n\nfrappe.views.calendar['Event'] = {\n field_map: {\n start: 'starts_on',\n end: 'ends_on',\n id: 'name',\n allDay: 'all_day',\n title: 'subject',\n status: 'event_type',\n color: 'color'\n },\n style_map: {\n Public: 'success',\n Private: 'info'\n },\n order_by: 'ends_on',\n get_events_method: 'frappe.desk.doctype.event.event.get_events'\n}\n\nGantt View\n\nGantt view uses the same configuration file as calendar, so every DocType that has a Calendar view has a Gantt view too.\n\nIn case certain settings need to be overridden for the Event DocType's Gantt view (for example the order_by field) the configuration can be set in the event_calendar.js file with the following content.\n\nfrappe.views.calendar['Event'] = {\n field_map: {\n start: 'starts_on',\n end: 'ends_on',\n id: 'name',\n allDay: 'all_day',\n title: 'subject',\n status: 'event_type',\n color: 'color'\n },\n gantt: { // The values set here will override the values set in the object just for Gantt View\n order_by: 'starts_on',\n }\n style_map: {\n Public: 'success',\n Private: 'info'\n },\n order_by: 'starts_on',\n get_events_method: 'frappe.desk.doctype.event.event.get_events'\n}\n\nGantt View\n\nKanban View\n\nKanban view can be created for any DocType that has a Select field with options.\nThese options become the column names for the Kanban Board.\n\nDark Theme\n\nFrappe Framework has a first class support of dark theme. To switch the theme, click on your avatar on top right of the screen and click on \"Toggle Theme\". Once you click \"Toggle Theme\", you'll see following modal from which you can easily switch between available themes. To switch to dark theme select \"Timeless Night\".\n\nNote: You can also press CTRL + SHIFT + G to open this modal.",
  "scrapedAt": "2025-10-22T00:02:11.840Z"
}