{
  "route": "framework/user/en/introduction",
  "sourceUrl": "https://docs.frappe.io/framework/user/en/introduction",
  "title": "introduction",
  "content": "What is Frappe Framework?\n\nFrappe, pronounced fra-pay, is a full stack, batteries-included, web framework written in Python and Javascript with MariaDB as the database. It is the framework which powers ERPNext, is pretty generic and can be used to build database driven apps.\n\n \n\nWhy Frappe?\n\nThe key difference in Frappe compared to other frameworks is that meta-data is also treated as data. This enables you to build front-ends very easily. We believe in a monolithic architecture, so Frappe comes with almost everything you need to build a modern web application. It has a full featured Admin UI called the Desk that handles forms, navigation, lists, menus, permissions, file attachment and much more out of the box. Read more here.\n\nKey Features\n\nFull-Stack Framework: Frappe covers both front-end and back-end development, allowing developers to build complete applications using a single framework.\nBuilt-in Admin Interface: Provides a pre-built, customizable admin dashboard for managing application data, reducing development time and effort.\nRole-Based Permissions: Comprehensive user and role management system to control access and permissions within the application.\nREST API: Automatically generated RESTful API for all models, enabling easy integration with other systems and services.\nCustomizable Forms and Views: Flexible form and view customization using server-side scripting and client-side JavaScript.\nReport Builder: Powerful reporting tool that allows users to create custom reports without writing any code.\n\nInstallation\n\nBefore you can use Frappe, you need to install it. We have a complete installation guide which covers all possibilities, this guide will also help you understand the backend stack.\n\nLearning and community\n\nFrappe School - Learn Frappe Framework and ERPNext from the various courses by the maintainers or from the community.\nGitHub - Explore the source code, contribute, and collaborate with the Frappe community.\nDiscussion Forum - Hang out with our growing community on our forum, ask questions, help others and be a part of the community.\nbuildwithhussain.dev - Watch Frappe Framework being used in the wild to build world-class web apps.",
  "scrapedAt": "2025-10-22T00:00:58.117Z"
}