{
  "route": "framework/user/en/guides/basics/how-to-enable-backup-encryption",
  "sourceUrl": "https://docs.frappe.io/framework/user/en/guides/basics/how-to-enable-backup-encryption",
  "title": "how-to-enable-backup-encryption",
  "content": "Files created during the backup process can be encrypted using an Auto-generated key by checking the Encrypt Backup option and the data can be saved under the default or provided location.\n\nSystem Requirements\n\nFor MacOS, ensure that gnupg is installed in the system. Use the following command to install gnupg:\n\nbrew install gnupg\n\nMost Linux distributions already have GnuPG installed, and the current version will likely use GnuPG 2.0 by default.\n\nEncrypt Backup option\n\nUnder Settings tab go to System settings.\nInside the Backups section check the Encrypt Backup checkbox.\n\nThe system uses an auto-generated key supplied by the Site config. If no such key is found, a new key is generated. Any Administrator can later look it from the https://{site}/app/backups page.\n\nIt encrypts the public and private files as well as the partial backup files.\n\nBackup Encryption Status\n\nEncrypted backups are stored at the same location as the general backups ./sites/{site}/private/backups.\nEncrypted backups can be downloaded from the https://{site}/app/backups\nEncrypted backups are differentiated using the key icon.\n\nBackup Encryption Key\n\nTo get the backup encryption key go to the ./sites/{site}/private/backups.\nClick on the Get Encrpytion key and verify your password.\n\nCopy the key to restore the encrypted backup files.\n\nRestoring the Encrypted backup files\n\nThe bench restore SQL_FILE_PATH can be used to restore the files without --backup-encryption-key as it is automatically picked from the Site Config.\nIn case of an unsuccessful restoration due to a wrong key --backup-encryption-key can be used to provide the key to restore the files.\nUsage:\n\nFor full backup files\nbench --site {site} restore --backup-encryption-key {key} [OPTIONS]\n\nFor partial backup files\nbench --site {site} partial-restore --backup-encryption-key {key} [OPTIONS]",
  "scrapedAt": "2025-10-22T00:02:18.863Z"
}