{
  "route": "framework/user/en/desk/workspace",
  "sourceUrl": "https://docs.frappe.io/framework/user/en/desk/workspace",
  "title": "workspace",
  "content": "Workspace is the first page you land on when you log in.\nIt also has a dedicated sidebar where you can rearrange the workspace position according to your convenience.\n\nThe workspace itself is a tool to build user-specific pages. \nIt comes with some standard workspaces which are listed in the PUBLIC section in the sidebar and are visible to all users.\nYou can also create private workspaces which will only be visible to the logged-in user(owner) in the MY WORKSPACES section. \n\nLet's build one and check out some cool features.\n\nCreate New Workspace\n\nClick on Create Workspace button.\nEnter Title and click on Create.\n\nCreate Child Workspace\n\nClick on Create Workspace button.\nEnter Title.\nSelect Home in the Parent field and click on Create.\n\nWorkspace Blocks\n\nThe workspace block is a building block for the workspace page.\nThese blocks can be placed in different variations to build an ideal workspace for a specific use case.\n\nLearn More →\n\nSidebar\n\nThere are two sections in the sidebar MY WORKSPACES & PUBLIC.\n\nYou can create as many private workspaces as you want.\nIt will only be visible to the currently logged-in user(owner) under the MY WORKSPACES section\n\nAll the standard workspaces comes under PUBLIC section. \nYou can also create more public workspaces. These workspaces will be visible to all users.\n\nMore → \n\n Only users with Workspace Manager Role can create, edit or delete public workspaces\n\nCustomization\n\nWorkspace has two modes Read Only Mode and Edit Mode. You can start customizing your workspace by clicking on the Edit button.\nCustomizing Workspaces and Customizing Workspace Page are two different things.\n\n Adding new blocks from the workspace document will not work as the new workspace doesn't know exactly where to add that block (at which position). You can update the existing blocks from the workspace document but it is not recommended either. The best practice would be to use the new workspace builder UI to do all kinds of customization.",
  "scrapedAt": "2025-10-22T00:03:42.973Z"
}