{
  "route": "framework/assignments-and-todos",
  "sourceUrl": "https://docs.frappe.io/framework/assignments-and-todos",
  "title": "Overview",
  "content": "Overview\n\nThe ToDo doctype in Frappe Framework helps users track and manage tasks assigned to themselves or to others. ToDos can be created independently or linked to other documents in the system, providing a centralized task management system.\n\nToDo Fields\n\nStatus: Can be \"Open\", \"Closed\", or \"Cancelled\"\nPriority: Set as \"High\", \"Medium\", or \"Low\" (default is \"Medium\")\nColor: Optional color tagging for visual identification\nDue Date: When the task should be completed\nDescription: The main content of the task (required)\nReference Type & Name: Optional link to a related document (e.g., a specific Issue, Lead, etc.)\nRole: Optional role assignment\nAssigned By: User who created or assigned the task\nAllocated To: User responsible for completing the task\n\nCreating ToDos\n\nToDos can be created in several ways:\n\nDirect Creation:\n\nNavigate to the ToDo list\nClick on \"Add ToDo\" button\nFill in the required details and save\n\nVia Assignment:\n\nFrom any document (e.g., Issue, Task), use the \"Assign To\" function\nThe system creates a ToDo and links it to that document\n\nVia Email:\n\nSend emails to the system with appropriate settings\nEmail content is converted to ToDos automatically (ToDo is in the email_append_to settings)\n\nVia Assignment Rules:\n\nSet up automatic assignments based on conditions\nThe system creates ToDos when conditions are met (note: Assignment Rules cannot be set on the ToDo doctype itself)\n\nManaging ToDos\n\nMarking as Completed\n\nTo mark a ToDo as completed:\n\nOpen the ToDo\nChange the status to \"Closed\"\nSave the document\n\nOnly the assignee (the user in the \"Allocated To\" field) can close their assigned ToDos. When done through the UI, the system will show an error if someone else tries to complete another person's ToDo.\n\nCancelling ToDos\n\nTo cancel a ToDo:\n\nOpen the ToDo\nChange the status to \"Cancelled\"\nSave the document\n\nCancelling differs from completion as it indicates the task won't be done rather than has been done.\n\nImpact of Due Date\n\nThe due date field:\n\nHelps in prioritizing tasks\nProvides a target completion date\nIs used in listing views to sort and filter ToDos\nIs used by Assignment Rules for automated due date management\n\nHowever, the system does not automatically send reminders when due dates are approaching or have passed. If you need this, consider creating a custom Notification.\n\nNotifications\n\nThe system sends notifications in the following scenarios:\n\nWhen a document is assigned or the assignment is cancelled:\n\nThe assignee receives a notification\nThe notification includes the task description and who assigned it, or cancelled the assignment\n\nGlobal Notification Counter:\n\nOpen ToDos contribute to the notification counter in the Frappe interface\nThe counter helps users see at a glance how many open tasks they have\n\nPermissions\n\nUsers can see ToDos assigned to them or created by them\nSystem Managers have access to all ToDos\nThe \"All\" role has permission to create, read, write, and delete ToDos\n\nIntegration with Other Documents\n\nWhen a ToDo is linked to another document:\n\nA comment is added to the referenced document when the ToDo is assigned\nA comment is added when the ToDo is completed or cancelled\nThe list of assigned users is updated in the referenced document's _assign field\nWhen viewing the referenced document, users can see who the document is assigned to\n\nWorking with Assignment Rules\n\nWhile Assignment Rules cannot be created for the ToDo doctype itself, they can create ToDos for other doctypes:\n\nCreate rules based on document conditions\nAssign tasks using round-robin, load balancing, or field-based assignment\nAutomatically set due dates based on document fields\nClose or reassign ToDos when document conditions change\n\nAssignment Rules provide powerful automation for task management across the system.",
  "scrapedAt": "2025-10-22T00:02:24.540Z"
}