{
  "route": "framework/user/en/python-api/language",
  "sourceUrl": "https://docs.frappe.io/framework/user/en/python-api/language",
  "title": "Here, let's take a look into how language in Frappe is resolved, and how you may",
  "content": "Here, let's take a look into how language in Frappe is resolved, and how you may\nbe able to use them in your Frappe apps or scripts.\n\nThe language for your session depends on the value of frappe.lang. This is\nresolved in the following order:\n\nForm Dict > _lang\nCookie > preferred\\_language _[Guest User only]_\nRequest Header > Accept-Language _[Guest User only]_\nUser document > language\nSystem Settings > language\n\nForm Dict: _lang\n\nThe Form Dict's _lang parameter has the highest priority. Setting this will\nupdate all translatable components in given request. Frappe uses this mechanism\nin certain places to handle Email Templates and Print views.\n\nCookie: preferred_language\n\nAlthough, it may not be practical to pass a ?_lang=ru in every request. If you\nwant persistent yet temporary language setting, you can set the\npreferred_language key in cookies. Frappe utilizes this for the website\nlanguage switcher. This method may be used to persist language\nbased on the client.\n\n Only considered for Guest Users. Ignored for logged in users.\n\nRequest Header: Accept-Language\n\nAnother relatively cleaner, and standard way to manage languages is using the\nAccept-Language header. If the previous two methods aren't set, Frappe starts\nresolving this header's values, which have an ordered set of a range of\nacceptable languages by the client. You can check out the Mozilla\nDocs\non this topic for more clarity perhaps.\n\n Only considered for Guest Users. Ignored for logged in users.\n\nUser & System Settings\n\nThe User document has a language field that sets the session language for said\nuser. This setting persists across devices, clients. This allows a particular\nuser to view the website, and Desk in a language of their choice. Say for\ninstance, a user sets their language as \"Russian\" on a \"French\" site, when they\nlogin, the site would be translated to Russian automatically.\n\nThe language field in the System Settings sets the language for the entire\nsite. It has the lowest priority and is the fallback language for all sessions.",
  "scrapedAt": "2025-10-22T00:01:45.245Z"
}