{
  "route": "framework/user/en/guides/integration/openid_connect_and_frappe_social_login",
  "sourceUrl": "https://docs.frappe.io/framework/user/en/guides/integration/openid_connect_and_frappe_social_login",
  "title": "OpenID Connect",
  "content": "OpenID Connect\n\nFrappe also uses Open ID connect essential standard for authenticating users. To get id_token with access_token, pass openid as the value for the scope parameter during authorization request.\n\nIf the scope is openid the JSON response with access_token will also include a JSON Web Token (id_token) signed with HS256 and Client Secret. The decoded id_token includes the at_hash.\n\nExample Bearer Token with scope openid\n\n{\n \"token_type\": \"Bearer\",\n \"id_token\": \"eyJhbGciOiJIUzI1NiIsInR5cCI6Imp3dCJ9.eyJpc3MiOiJodHRwczovL21udGVjaG5pcXVlLmNvbSIsImF0X2hhc2giOiJOQlFXbExJUy1lQ1BXd1d4Y0EwaVpnIiwiYXVkIjoiYjg3NzJhZWQ1YyIsImV4cCI6MTQ3Nzk1NTYzMywic3ViIjoiNWFjNDE2NThkZjFiZTE1MjI4M2QxYTk0YjhmYzcwNDIifQ.1GRvhk5wNoR4GWoeQfleEDgtLS5nvj9nsO4xd8QE-Uk\",\n \"access_token\": \"ZJD04ldyyvjuAngjgBrgHwxcOig4vW\",\n \"scope\": \"openid\",\n \"expires_in\": 3600,\n \"refresh_token\": \"2pBTDTGhjzs2EWRkcNV1N67yw0nizS\"\n}\n\nFrappe social login setup\n\nIn this example there are 2 servers,\n\nPrimary Server\n\nThis is the main server hosting all the users. e.g. https://frappe.io. To setup this as the main server, go to Setup > Integrations > Social Login Keys and enter https://frappe.io in the field Frappe Server URL. This URL repeats in all other Frappe servers who connect to this server to authenticate. Effectively, this is the main Identity Provider (IDP).\n\nUnder this server add as many OAuth Client(s) as required. Because we are setting up one app server, add only one OAuth Client\n\nFrappe App Server\n\nThis is the client connecting to the IDP. Go to Setup > Integrations > Social Login Keys on this server and add appropriate values to Frappe Client ID and Frappe Client Secret (refer to client added in primary server). As mentioned before keep the Frappe Server URL as https://frappe.io\n\nNow you will see Frappe icon on the login page. Click on this icon to login with account created in primary server (IDP) https://frappe.io\n\nNote: If Skip Authorization is checked while registering a client, page to allow or deny the granting access to resource is not shown. This can be used if the apps are internal to one organization and seamless user experience is needed.\n\nSteps\n\nPart 1 : on Frappe Identity Provider (IDP)\n\nLogin to IDP\n\nAdd OAuth Client on IDP\n\nSet Server URL on IDP\n\nPart 2 : on Frappe App Server\n\nSet Frappe Client ID and Frappe Client Secret on App server (refer the client set on IDP)\n\nNote: Frappe Server URL is the main server where identities from your organization are stored.\n\nLogin Screen on App Server (login with frappe)\n\nPart 3 : Redirected on IDP\n\nlogin with user on IDP\n\nConfirm Access on IDP\n\nPart 4 : Back on App Server\n\nLogged in on app server with ID from IDP",
  "scrapedAt": "2025-10-22T00:03:14.890Z"
}