{
  "route": "framework/user/en/guides/integration/how_to_set_up_oauth",
  "sourceUrl": "https://docs.frappe.io/framework/user/en/guides/integration/how_to_set_up_oauth",
  "title": "how_to_set_up_oauth",
  "content": "OAuth 2.0 provider based on oauthlib is built into frappe. Third party apps can now access resources of users based on Frappe Role and User permission system. To setup an app to access\n\nOAuth 2 defines four roles\n\nresource owner\n\nAn entity capable of granting access to a protected resource. When the resource owner is a person, it is referred to as an end-user.\n\nresource server\n\nThe server hosting the protected resources, capable of accepting and responding to protected resource requests using access tokens.\n\nclient\n\nAn application making protected resource requests on behalf of the resource owner and with its authorization. The term \"client\" does not imply any particular implementation characteristics (e.g.,\nwhether the application executes on a server, a desktop, or other devices).\n\nauthorization server\n\nThe server issuing access tokens to the client after successfully authenticating the resource owner and obtaining authorization.\n\nSetup OAuth 2 Provider\n\nSystem Managers can setup behavior of confirmation message as Force or Auto in OAuth Provider Settings.\nIf Force is selected the system will always ask for user's confirmation. If Auto is selected system asks for the confirmation only if there are no active tokens for the user.\n\nGo to\n\n Setup > Integrations > OAuth Provider Settings\n\nAdd Primary Server\n\nThis is the main server hosting all the users. e.g. https://frappe.io. To setup this as the main server, go to Setup > Integrations > Social Login Key and add new Frappe Social Login Key. Enter https://frappe.io in the field Base URL. This URL repeats in all other Frappe servers who connect to this server to authenticate. Effectively, this is the main Identity Provider (IDP).\n\nUnder this server add as many OAuth Client(s) as required.\n\nAdd a Client App\n\nAs a System Manager go to\n\n Setup > Integrations > OAuth Client\n\nTo add a client fill in the following details\n\nApp Name : Enter App Name e.g. CAVS\nSkip Authorization : If this is checked, during authentication there won't be me any confirmation message. Skip Authorization means the client is treated as trusted client.\nScopes : List of scopes shown to user along with confirmation message. scopes are separated by space.\nRedirect URIs : List of Redirect URIs separated by space.\nDefault Redirect URIs : Default Redirect URI from list of Redirect URIs\nGrant Type: select Authorization Code or Implicit.\nResponse Type: select Code if grant type is Authorization Code or select Token.\n\nUsing OAuth 2\n\nPlease refer to the API documentation to learn how to use OAuth 2 in you application.",
  "scrapedAt": "2025-10-22T00:03:17.411Z"
}