{
  "route": "framework/user/en/microsoft-email-oauth",
  "sourceUrl": "https://docs.frappe.io/framework/user/en/microsoft-email-oauth",
  "title": "microsoft-email-oauth",
  "content": "This guide helps in authenticating an outlook email account in frappe.\n\nGo to your Frappe instance and create a New Connected App and save it (just enter the name and save) and copy the Redirect URI for later.\n\nLogin to Microsoft Azure, search for and select Microsoft Entra ID (formerly called Azure Active Directory).\n\nClick Add -> App registration\n\nEnter the respective details (app name, account type), paste the previously copied redirect URI from Frappe instance and select the platform as “Web”.\n\nTo know more about the account types, click here\n\nClick on Register and you’ll be redirected to your created app. Copy your Application ID - it’s the Client ID you'll need to paste into your Connected App on your Frappe instance.\n\nHead over to API Permission section in your app and add Microsoft Graph permissions.\n\nSelect Delegated Permissions for IMAP.AccessAsUserAll, SMTP.Send and offline_access, then click \"Add permissions\"\n\nHead over to Certificates & Secrets to create a Client Secret\n\nAdd description and click on add to see a newly generated client secret.\n\nCopy over the Value - paste this in the Client Secret field in the new Connected App on your Frappe instance.\n\nClick on \"Endpoints\" and copy \"OpenID Connect metadata document\". This should be pasted into the \"OpenID Configuration\" field of your Frappe Connected App. After that, click \"Get OpenID Configuration\" on the Connected App, that will populate the endpoints.\n\nThen, add these scopes, and save the document.\n\nhttps://outlook.office.com/IMAP.AccessAsUser.All\nhttps://outlook.office.com/SMTP.Send\noffline_access\n\nClick on the “Connect to {your connected app name}” button on top right which should start the Oauth flow for Microsoft.\n\nMake sure the email account you’re authorizing is going to be the same as the one you’re going to add in frappe.\n\nIf everything goes as planned, you’ll be redirected back to your Connected App page and should be able to see Token Cache connected to your connected app, head over to your created token cache to check if you have both refresh and access token.\n\n \n\nHead over to Email Account doctype and create a new Email Account. And select the method as Oauth and add your connected app and user which has created the token cache and set up your email account as usual.\n\n \n\nPlease ensure IMAP/POP connections are allowed on your Microsoft account. You can find information regarding that, as well as the settings for outlook servers over here: https://support.microsoft.com/en-us/office/pop-imap-and-smtp-settings-8361e398-8af4-4e97-b147-6c6c4ac95353\n\nNOTE: Microsoft restricts sending from any other email address other than the one which authenticated it. For that you can check these 2 options in the email account document itself\n\n \n\nPlease visit Microsoft’s official documentation for any Additional Info: https://learn.microsoft.com/en-us/exchange/client-developer/legacy-protocols/how-to-authenticate-an-imap-pop-smtp-application-by-using-oauth\n\nService Principal Authentication\n\nEmail Accounts require access as a User. This disallowed the use of Shared Mailboxes dedicated to Frappe, as Full Access permissions would need to be granted to the user signing into Frappe.\n\nThis feature lets Frappe authenticate itself to e.g. Exchange Online, so it can send and receive emails from the Shared Mailbox, without having to delegate Full Access permissions to each user that accesses Frappe.\n\nIf you wish to authenticate using this method, there's a checkbox available in Email Account",
  "scrapedAt": "2025-10-22T00:03:59.836Z"
}