{
  "route": "framework/user/en/rate-limiting",
  "sourceUrl": "https://docs.frappe.io/framework/user/en/rate-limiting",
  "title": "rate-limiting",
  "content": "Frappe framework has out of the box support for rate-limiting HTTP requests.\n\nFrappe framework implements fixed window rate-limiting based on time consumed by requests. The limit is enforced on the sum of time taken by all HTTP requests made in the configured window. The cycle resets after every window seconds, for instance, setting window to 3600 seconds will reset the usage counter to 0 at the beginning of every hour based on site's timezone.\n\nNote: Requests over limit are not processed and are sent HTTP 429 (Too Many Requests) response.\n\nYou can enable rate limiting on your site by adding configuration similar to the following in site_config.json:\n\n{\n \"rate_limit\": {\n \"limit\": 600,\n \"window\": 3600\n }\n}\n\n Key\n Description\n\n limit\n Maximum amount of time permitted to use in the rate limit window (in seconds).\n\n window\n Size of the rate limit window (in seconds).\n\nThe returned HTTP headers of every HTTP request show the current rate limit status, e.g.\n\ncurl -i https://frappe.io/docs\nHTTP/1.1 200 OK\nX-RateLimit-Limit: 600000000\nX-RateLimit-Remaining: 518060453\nX-RateLimit-Reset: 3513\nX-RateLimit-Used: 100560\n\nIn case of requests made after configured limits are exhausted, HTTP 429 response is returned along with the rate limit status:\n\ncurl -i https://frappe.io/docs\nHTTP/1.1 429 TOO MANY REQUESTS\nX-RateLimit-Limit: 600000000\nX-RateLimit-Remaining: 0\nX-RateLimit-Reset: 1242\nRetry-After: 1242\n\n Header\n Description\n\n Retry-After\n Time remaining till the current rate limit window resets (in seconds).\n\n X-RateLimit-Limit\n Time permitted to use in a rate limit window (in microseconds).\n\n X-RateLimit-Remaining\n Time remaining (to be used) in the current rate limit window (in microseconds).\n\n X-RateLimit-Reset\n Time remaining till the current rate limit window resets (in seconds).\n\n X-RateLimit-Used\n Time used for processing the current request (in microseconds).",
  "scrapedAt": "2025-10-22T00:04:41.425Z"
}